Tekla Open API Reference for Tekla Structures 2025
GraphicsDrawer.DrawMeshLines Method
 Draws the mesh lines as temporary graphics in the currently active Tekla Structures rendered view.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DrawMeshLines(
	Mesh Mesh,
	Color Color
)
Public Function DrawMeshLines (
	Mesh As Mesh,
	Color As Color
) As Boolean
Parameters
Mesh
Type: Tekla.Structures.Model.UI.Mesh
The mesh to draw.
Color
Type: Tekla.Structures.Model.UI.Color
The color of the mesh lines. The transparency value of the color is ignored.
Return Value
Type: Boolean
True on success.
See Also
Reference
GraphicsDrawer Class
Tekla.Structures.Model.UI Namespace